from typing import Final


AGE_CODEBOOK: Final[dict[str, str]] = {
    "A01": "청소년",
    "A02": "청년",
    "A03": "중년",
    "A04": "노년",
}

GENDER_CODEBOOK: Final[dict[str, str]] = {
    "G01": "남성",
    "G02": "여성",
}

COMPUTER_CODEBOOK: Final[dict[str, str]] = {
    "C01": "응답",
}

SITUATION_CODEBOOK: Final[dict[str, str]] = {
    "S01": "가족관계",
    "S02": "학업 및 진로",
    "S03": "학교폭력/따돌림",
    "S04": "대인관계",
    "S05": "연애,결혼,출산",
    "S06": "진로,취업,직장",
    "S07": "대인관계(부부, 자녀)",
    "S08": "재정,은퇴,노후준비",
    "S09": "건강",
    "S10": "직장, 업무 스트레스",
    "S11": "건강,죽음",
    "S12": "대인관계(노년)",
    "S13": "재정",
}

DISEASE_CODEBOOK: Final[dict[str, str]] = {
    "D01": "만성질환 유",
    "D02": "만성질환 무",
}

EMOTION_CODEBOOK: Final[dict[str, str]] = {
    "E10": "분노",
    "E11": "툴툴대는",
    "E12": "좌절한",
    "E13": "짜증내는",
    "E14": "방어적인",
    "E15": "악의적인",
    "E16": "안달하는",
    "E17": "구역질 나는",
    "E18": "노여워하는",
    "E19": "성가신",

    "E20": "슬픔",
    "E21": "실망한",
    "E22": "비통한",
    "E23": "후회되는",
    "E24": "우울한",
    "E25": "마비된",
    "E26": "염세적인",
    "E27": "눈물이 나는",
    "E28": "낙담한",
    "E29": "환멸을 느끼는",

    "E30": "불안",
    "E31": "두려운",
    "E32": "스트레스 받는",
    "E33": "취약한",
    "E34": "혼란스러운",
    "E35": "당혹스러운",
    "E36": "회의적인",
    "E37": "걱정스러운",
    "E38": "조심스러운",
    "E39": "초조한",

    "E40": "상처",
    "E41": "질투하는",
    "E42": "배신당한",
    "E43": "고립된",
    "E44": "충격 받은",
    "E45": "가난한, 불우한",
    "E46": "희생된",
    "E47": "억울한",
    "E48": "괴로워하는",
    "E49": "버려진",

    "E50": "당황",
    "E51": "고립된(당황한)",
    "E52": "남의 시선을 의식하는",
    "E53": "외로운",
    "E54": "열등감",
    "E55": "죄책감의",
    "E56": "부끄러운",
    "E57": "혐오스러운",
    "E58": "한심한",
    "E59": "혼란스러운(당황한)",

    "E60": "기쁨",
    "E61": "감사하는",
    "E62": "신뢰하는",
    "E63": "편안한",
    "E64": "만족스러운",
    "E65": "흥분",
    "E66": "느긋",
    "E67": "안도",
    "E68": "신이 난",
    "E69": "자신하는",
}

COARSE_EMOTION_CODEBOOK: Final[dict[str, str]] = {
    "E1": "분노",
    "E2": "슬픔",
    "E3": "불안",
    "E4": "상처",
    "E5": "당황",
    "E6": "기쁨",
}


def get_coarse_emotion(emotion_code: str) -> str:
    if emotion_code not in EMOTION_CODEBOOK:
        raise ValueError(f"Unknown emotion code: {emotion_code}")

    prefix = emotion_code[:2]

    return COARSE_EMOTION_CODEBOOK[prefix]